{
  "_name_or_path": "/mnt/scratch/syx/checkpoint-500/checkpoint-500_bak",
  "architectures": [
    "BambooForCausalLM"
  ],
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_bamboo.BambooConfig",
    "AutoModel": "modeling_bamboo.BambooForCausalLM",
    "AutoModelForCausalLM": "modeling_bamboo.BambooForCausalLM"
  },
  "bos_token_id": 1,
  "eos_token_id": 2,
  "hidden_act": "relu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 14336,
  "max_position_embeddings": 32768,
  "model_type": "bamboo",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "num_key_value_heads": 8,
  "rms_norm_eps": 1e-05,
  "rope_theta": 10000.0,
  "sliding_window": 4096,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.41.0",
  "use_cache": false,
  "vocab_size": 32064
}
